Repository: ufal/charles-translator-ios
Catalog: CharlesTranslator/Resources/Localizable.xcstrings
Source language: en
Languages: cs, ru, sk, uk

source: About
cs: O aplikaci
ru: О приложении
sk: O aplikácií
uk: Про додаток

source: Agree
cs: Souhlasím
ru: Я даю согласие
sk: Súhlasím
uk: Я надаю згоду

source: All
cs: Vše
ru: Все
sk: Všetko
uk: Всі

source: Allow data collection
cs: Povolit sběr dat
ru: Разрешить сбор данных
sk: Povoliť zber dát
uk: Дозволити збір даних

source: Cancel
cs: Zrušit
ru: Отмена
sk: Zrušiť
uk: Скасувати

source: Clear
cs: Vymazat
ru: Очистить
sk: Vymazať
uk: Очистити

source: Close
cs: Zavřít
ru: Закрыть
sk: Zavrieť
uk: Закрити

source: Contact support
cs: Kontaktovat podporu
ru: Связаться со службой поддержки
sk: Kontaktovať podporu
uk: Зв'язатися з підтримкою

source: Conversation
cs: Konverzace
ru: Разговоры
sk: Konverzácia
uk: Розмови

source: Data processing
cs: Zpracování dat
ru: Обработка данных
sk: Spracovanie dát
uk: Опрацювання даних

source: Delete
cs: Smazat
ru: Удалить
sk: Zmazať
uk: Видалити

source: Disagree
cs: Nesouhlasím
ru: Я не даю согласие
sk: Nesúhlasím
uk: Я не надаю згоду

source: Done
cs: Hotovo
ru: Готово
sk: Hotovo
uk: Готово

source: Enter text
cs: Napište text
ru: Введите текст
sk: Napíšte text
uk: Введіть текст

source: Erase
cs: Vymazat
ru: Стереть
sk: Vymazať
uk: Видалити

source: Erase all app data?
cs: Vymazat všechna data aplikace?
ru: Стереть все данные приложения?
sk: Vymazať všetky dáta aplikácie?
uk: Видалити всі дані додатку?

source: Erase app data
cs: Vymazat data aplikace
ru: Стереть данные приложения
sk: Vymazať dáta aplikácie
uk: Видалити дані додатку

# error.decoding
source: The translation service returned an unexpected response.
cs: Překladová služba vrátila neočekávanou odpověď.
ru: Служба перевода вернула неожиданный ответ.
sk: Prekladová služba vrátila neočakávanú odpoveď.
uk: Служба перекладу повернула несподівану відповідь.

# error.network
source: Couldn't reach the translation service. Check your connection.
cs: Nelze se připojit k překladové službě. Zkontrolujte připojení k internetu.
ru: Не удалось связаться со службой перевода. Проверьте подключение к интернету.
sk: Nepodarilo sa pripojiť k prekladovej službe. Skontrolujte internetové pripojenie.
uk: Не вдалося зв'язатися зі службою перекладу. Перевірте підключення до інтернету.

# error.speechPermissionDenied
source: Enable Microphone and Speech Recognition access in Settings to use voice input.
cs: Pro použití hlasového vstupu povolte v Nastavení přístup k mikrofonu a rozpoznávání řeči.
ru: Чтобы использовать голосовой ввод, разрешите в Настройках доступ к микрофону и распознаванию речи.
sk: Ak chcete používať hlasový vstup, povoľte v Nastaveniach prístup k mikrofónu a rozpoznávaniu reči.
uk: Щоб використовувати голосовий ввід, увімкніть у Налаштуваннях доступ до мікрофона та розпізнавання мовлення.

# error.speechUnavailable
source: Speech recognition isn't available right now.
cs: Rozpoznávání řeči momentálně není k dispozici.
ru: Распознавание речи сейчас недоступно.
sk: Rozpoznávanie reči momentálne nie je k dispozícii.
uk: Розпізнавання мовлення зараз недоступне.

# error.timeout
source: Translation took too long and timed out.
cs: Překlad trval příliš dlouho a vypršel časový limit.
ru: Перевод занял слишком много времени, и время ожидания истекло.
sk: Preklad trval príliš dlho a vypršal časový limit.
uk: Переклад тривав занадто довго, і час очікування вичерпано.

# error.tooLarge
source: This text is too long to translate.
cs: Tento text je příliš dlouhý na překlad.
ru: Этот текст слишком длинный для перевода.
sk: Tento text je príliš dlhý na preklad.
uk: Цей текст занадто довгий для перекладу.

# error.unknown
source: Something went wrong while translating.
cs: Při překladu se něco pokazilo.
ru: Что-то пошло не так во время перевода.
sk: Počas prekladu sa niečo pokazilo.
uk: Щось пішло не так під час перекладу.

# error.unsupportedApiVersion
source: This app version is no longer supported. Please update.
cs: Omlouváme se, ale je nutné aplikaci aktualizovat, jinak nebude dále fungovat.
ru: Извините, но приложение необходимо обновить, иначе оно больше не будет работать.
sk: Ospravedlňujeme sa, ale je nutné aplikáciu aktualizovať, inak nemôže ďalej fungovať.
uk: Вибачте, але додаток необхідно оновити, інакше він не зможе працювати далі.

# error.unsupportedPair
source: Cannot translate between these two languages.
cs: Mezi těmito dvěma jazyky nelze překládat.
ru: Невозможно перевести между этими двумя языками.
sk: Medzi týmito dvoma jazykmi nemožno prekladať.
uk: Неможливо перекласти між цими двома мовами.

source: Favourite
cs: Oblíbit
ru: Добавить в избранное
sk: Pridať do obľúbených
uk: Додати в обране

source: Favourites
cs: Oblíbené
ru: Избранное
sk: Obľúbené
uk: Обране

source: History
cs: Historie překladů
ru: История переводов
sk: História prekladov
uk: Історія перекладів

source: History filter
cs: Filtr historie
ru: Фильтр истории
sk: Filter histórie
uk: Фільтр історії

source: I am giving the Institute of Formal and Applied Linguistics, Faculty of Mathematics and Physics, Charles University (UFAL MFF UK) consent to collect my inputs and translations. The texts will be anonymized and may be used for future development of the system.
cs: Souhlasím s tím, aby Ústav formální a aplikované lingvistiky MFF UK ukládal vstupy a výstupy z překladače. V případě souhlasu mohou být anonymizované texty využity pro další vývoj systému.
ru: Я даю Институту формальной и прикладной лингвистики, физико-математического факультета Карлова университета в Праге (UFAL MFF UK) согласие на сбор и обработку моих текстов и полученных переводов. Тексты будут анонимизированы и могут быть использованы для дальнейшего развития системы.
sk: Súhlasím s tým, aby Ústav formální a aplikované lingvistiky MFF UK ukladal vstupy a výstupy z prekladača. V prípade súhlasu môžu byť anonymizované texty využité na ďalší vývoj systému.
uk: Я надаю Інституту формальної і прикладної лінгвістики, Фізико-математичного факультету Карлового університету в Празі (UFAL MFF UK) згоду на зберігання і опрацювання наданих мною текстів і отриманих перекладів. Тексти будуть анонімізовані і можуть бути використані для подальшого удосконалення системи.

source: Identification
cs: Identifikace
ru: Идентификация
sk: Identifikácia
uk: Ідентифікація

source: If your organization has an agreement with us to track its traffic, provide its name here.
cs: Doplňte název vaší organizace, pokud jste k tomu byli vyzváni.
ru: Укажите название организации, если вас об этом попросили.
sk: Vyplňte meno organizácie, ak ste o to boli požiadaní.
uk: Заповніть назву організації, якщо вас про це попросили.

source: Indicates languages whose dictation and speech models are downloaded for offline use.
cs: Zobrazuje jazyky, jejichž modely diktování a řeči jsou staženy pro použití offline.
ru: Показывает языки, чьи модели диктовки и речи загружены для использования в офлайн-режиме.
sk: Zobrazuje jazyky, ktorých modely diktovania a reči sú stiahnuté na použitie offline.
uk: Показує мови, чиї моделі диктування та мовлення завантажено для використання в офлайн-режимі.

# language.cs
source: Czech
cs: Čeština
ru: Чешский
sk: Čeština
uk: Чеська

# language.en
source: English
cs: Angličtina
ru: Английский
sk: Angličtina
uk: Англійська

# language.fr
source: French
cs: Francouzština
ru: Французский
sk: Francúzština
uk: Французька

# language.pl
source: Polish
cs: Polština
ru: Польский
sk: Poľština
uk: Польська

# language.ru
source: Russian
cs: Ruština
ru: Русский
sk: Ruština
uk: Російська

# language.uk
source: Ukrainian
cs: Ukrajinština
ru: Украинский
sk: Ukrajinčina
uk: Українська

source: No favourites yet
cs: Uložte si své oblíbené překlady z historie (ikonka hvězdičky). Poté je najdete na této obrazovce.
ru: Сохраняйте свои избранные переводы из истории (иконка-звёздочка). Затем вы сможете найти их на этом экране.
sk: Uložte si svoje obľúbené preklady z histórie (ikonka hviezdičky). Následne ich nájdete na tejto obrazovke.
uk: Зберігайте свої улюблені переклади з історії (іконка-зірочка). Потім ви зможете знайти їх на цьому екрані.

source: No history yet
cs: Během překládání se texty automaticky ukládají a zde je jejich historie.
ru: Во время перевода тексты сохраняются автоматически. Вы можете увидеть их историю здесь.
sk: V priebehu prekladania sa texty automaticky ukladajú a uvidíte tu ich históriu.
uk: Під час перекладу тексти зберігаються автоматично. Ви можете побачити тут їхню історію.

source: Offline speech models
cs: Offline modely řeči
ru: Офлайн модели речи
sk: Offline modely reči
uk: Офлайн моделі мовлення

source: Organization name
cs: Název organizace
ru: Название организации
sk: Meno organizácie
uk: Назва організації

# picker.sourceLanguage
source: Translate from
cs: Přeložit z
ru: Перевести с
sk: Preložiť z
uk: Перекласти з

# picker.targetLanguage
source: Translate to
cs: Přeložit do
ru: Перевести на
sk: Preložiť do
uk: Перекласти на

source: Privacy
cs: Ochrana soukromí
ru: Конфиденциальность
sk: Ochrana súkromia
uk: Конфіденційність

source: Settings
cs: Nastavení
ru: Настройки
sk: Nastavenia
uk: Налаштування

# settings.offline.dictation
source: dictation
cs: diktování
ru: диктовка
sk: diktovanie
uk: диктування

# settings.offline.onDevice
source: on device
cs: na zařízení
ru: на устройстве
sk: na zariadení
uk: на пристрої

# settings.offline.onlineOnly
source: online only
cs: pouze online
ru: только онлайн
sk: iba online
uk: тільки онлайн

# settings.offline.speech
source: speech
cs: řeč
ru: речь
sk: reč
uk: мовлення

# settings.offline.unavailable
source: unavailable
cs: nedostupné
ru: недоступно
sk: nedostupné
uk: недоступно

source: Start voice input
cs: Spustit hlasový vstup
ru: Начать голосовой ввод
sk: Spustiť hlasový vstup
uk: Почати голосовий ввід

source: Stop listening
cs: Ukončit poslech
ru: Остановить прослушивание
sk: Ukončiť počúvanie
uk: Зупинити прослуховування

source: Swap languages
cs: Prohodit jazyky
ru: Поменять местами языки
sk: Prehodiť jazyky
uk: Поміняти місцями мови

source: Tap a microphone to start a conversation
cs: Pro začátek konverzace klikněte na mikrofon v dolní části obrazovky
ru: Чтобы начать разговор, нажмите на микрофон внизу экрана
sk: Ak chcete začať konverzáciu, kliknite na mikrofón v dolnej časti obrazovky
uk: Для початку розмови клацніть мікрофон внизу екрана

source: This deletes your saved history and resets your privacy choices. This can't be undone.
cs: Tímto smažete uloženou historii a obnovíte svá nastavení ochrany soukromí. Tento krok nelze vrátit.
ru: Это удалит сохранённую историю и сбросит ваши настройки конфиденциальности. Это действие нельзя отменить.
sk: Týmto vymažete uloženú históriu a obnovíte svoje nastavenia ochrany súkromia. Tento krok nemožno vrátiť.
uk: Це видалить збережену історію та скине ваші налаштування конфіденційності. Цю дію неможливо скасувати.

source: Translate
cs: Překladač
ru: Переводчик
sk: Prekladač
uk: Перекладач

source: Unfavourite
cs: Zrušit oblíbené
ru: Удалить из избранного
sk: Odobrať z obľúbených
uk: Видалити з обраного

source: Version
cs: Verze
ru: Версия
sk: Verzia
uk: Версія

source: You can change this decision anytime in Settings.
cs: Toto rozhodnutí můžete kdykoli změnit v Nastavení.
ru: Вы можете изменить это решение в любое время в Настройках.
sk: Toto rozhodnutie môžete kedykoľvek zmeniť v Nastaveniach.
uk: Ви можете будь-коли змінити це рішення в Налаштуваннях.
